#include "sys.h"

/**
  *****************************************************************************
  * @Name   : 关闭所有中断(但是不包括fault和NMI中断)
  *
  * @Brief  : none
  *
  * @Input  : none
  *
  * @Output : none
  *
  * @Return : none
  *****************************************************************************
**/
__asm void INTX_DISABLE(void)
{
	CPSID   I
	BX      LR	  
}

/**
  *****************************************************************************
  * @Name   : 开启所有中断
  *
  * @Brief  : none
  *
  * @Input  : none
  *
  * @Output : none
  *
  * @Return : none
  *****************************************************************************
**/
__asm void INTX_ENABLE(void)
{
	CPSIE   I
	BX      LR  
}

